radicore/SOAP/test-request-3.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="urn:radicore_v1" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <ns1:menu_getPatternList>
            <params xsi:type="ns1:menu_getPatternListRequest">
                <limit xsi:type="xsd:int">10</limit>
                <page_no xsi:type="xsd:int">1</page_no>
                <order xsi:type="xsd:string">pattern_id</order>
            </params>
        </ns1:menu_getPatternList>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
